slatedriver-application/app/controllers/slates_controller.rb

  def show
    slate = current_user.slates.find(params[:id])
---
SELECT  "slates".* FROM "slates" WHERE "slates"."user_id" = ? AND "slates"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    slate = current_user.slates.create(slate_params)
---
INSERT INTO "slates" ("user_id", "president", "president_reasons", "us_senate", "us_senate_reasons", "us_congress", "us_congress_reasons", "nv_senate", "nv_senate_reasons", "nv_assembly", "nv_assembly_reasons", "city_council1", "city_council1_reasons", "city_council2", "city_council2_reasons", "judge1", "judge1_reasons", "judge2", "judge2_reasons", "judge3", "judge3_reasons", "issue1", "issue1_reasons", "issue2", "issue2_reasons", "issue3", "issue3_reasons", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def latest
    slate = current_user.slates.order(:id).last
---
SELECT  "slates".* FROM "slates" WHERE "slates"."user_id" = ? ORDER BY "slates"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def update
    slate = current_user.slates.find(params[:id])
    slate.update(slate_params)
---
SELECT  "slates".* FROM "slates" WHERE "slates"."user_id" = ? AND "slates"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "slates" SET "president" = ?, "president_reasons" = ?, "us_senate" = ?, "us_senate_reasons" = ?, "us_congress" = ?, "us_congress_reasons" = ?, "nv_senate" = ?, "nv_senate_reasons" = ?, "nv_assembly" = ?, "nv_assembly_reasons" = ?, "city_council1" = ?, "city_council1_reasons" = ?, "city_council2" = ?, "city_council2_reasons" = ?, "judge1" = ?, "judge1_reasons" = ?, "judge2" = ?, "judge2_reasons" = ?, "judge3" = ?, "judge3_reasons" = ?, "updated_at" = ? WHERE "slates"."id" = ?